#include "led.h"

/**********************************************************
*  函数名称：100毫秒延时函数(11.0592MHz)
*  日期：2019-11-29
*  姓名：ZhangHJ
*  说明：由STC-ISP软件自动生成
***********************************************************/
void Delay100ms()		//@11.0592MHz
{
	unsigned char i, j, k;
	_nop_();
	_nop_();
	i = 5;
	j = 52;
	k = 195;
	do
	{
		do
		{
			while (--k);
		} while (--j);
	} while (--i);
}


/**********************************************************
*  函数名称：系统初始化函数
*  修改日期：2020-01-02
*  姓名：ZhangHJ
*  说明：用于关闭继电器和蜂鸣器
*		 1. 74HC138输入101 --> Y5=0 --> CY5=1
*		 2. 74HC573的输入经过ULN2003取反后,关闭继电器和蜂鸣器
***********************************************************/
void System_Init()
{
	WR = 0;
	HC138_C = 1;
	HC138_B = 0;
	HC138_A = 1;	// Y5=0 --> CY5 =1
	P0 = 0x00;		// 关闭继电器和蜂鸣器
}


/**********************************************************
*  函数名称：LED初始化函数
*  修改日期：2020-01-02
*  姓名：ZhangHJ
*  说明：用于配置LED
*		 1. 74HC138输入100 --> Y4=0 --> CY4=1
*		 2. WR或非Y4 --> CY4
***********************************************************/
void LED_config()
{
	WR = 0;
	HC138_C = 1;
	HC138_B = 0;
	HC138_A = 0;
}